Pandas DataFrames are two dimensional data structures with labeled rows and columns, that can hold many data types.

**Create a DataFrame Manually**

Creating a DataFrame manually from a dictionary of Pandas Series.
1. The first step is to create the dictionary of Pandas Series.
2. After the dictionary is created we can then pass the dictionary to the pd.DataFrame() function.

**Example 1: Create a DataFrame using a dictionary of Series**

In [1]:
import pandas as pd

items = {'Alice': pd.Series(data = [40, 110, 500, 45], index = ['book', 'glasses', 'bike', 'pants']),
          'Bob': pd.Series(data = [245, 25, 55], index = ['bike', 'pants', 'watch'])}

print(type(items))

<class 'dict'>

In [2]:
shopping_carts = pd.DataFrame(items)
shopping_carts

         Alice    Bob
bike     500.0  245.0
book      40.0    NaN
glasses  110.0    NaN
pants     45.0   25.0
watch      NaN   55.0

**Example 2: DataFrame assigns the numerical row indexes by default**

In [3]:
data = {'Alice': pd.Series(data = [40, 110, 500, 45]),
          'Bob': pd.Series(data = [245, 25, 55])}

df = pd.DataFrame(data)

df

   Alice    Bob
0     40  245.0
1    110   25.0
2    500   55.0
3     45    NaN

In [4]:
print('shopping_carts has shape:', shopping_carts.shape)
print('shopping_carts has dimension:', shopping_carts.ndim)
print('shopping_carts has a total of:', shopping_carts.size, 'elements')
print()
print('The data in shopping_carts is:\n', shopping_carts.values)
print()
print('The row index in shopping_carts is:', shopping_carts.index)
print()
print('The column index in shopping_carts is:', shopping_carts.columns)

shopping_carts has shape: (5, 2)
shopping_carts has dimension: 2
shopping_carts has a total of: 10 elements

The data in shopping_carts is:
 [[500. 245.]
 [ 40.  nan]
 [110.  nan]
 [ 45.  25.]
 [ nan  55.]]

The row index in shopping_carts is: Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

The column index in shopping_carts is: Index(['Alice', 'Bob'], dtype='object')

In [5]:
bob_shopping_cart = pd.DataFrame(items, columns = ['Bob'])
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

**Selecting Spesific Rows of a DataFrame**

In [7]:
selected_items = pd.DataFrame(items, index = ['pants', 'book'])
selected_items

       Alice   Bob
pants     45  25.0
book      40   NaN

**Selecting Spesific Columns of a DataFrame**

In [8]:
alice_selected_items = pd.DataFrame(items, index = ['glasses', 'bike'], columns = ['Alice'])
alice_selected_items

         Alice
glasses    110
bike       500

You can also manually create DataFrames from a dictionary of lists (arrays). The procedure is the same as before, we start by creating the dictionary and then passing the dictionary to the pd.DataFrame() function. In this case, however, all the lists (arrays) in the dictionary must be of the same length.

**Create a DataFrame using a dictionary of lists**

In [9]:
data = {'Floats': [4.5, 8.2, 9.6],
        'Integers': [1, 2, 3]}

df = pd.DataFrame(data)

df

   Floats  Integers
0     4.5         1
1     8.2         2
2     9.6         3

**Create a DataFrame using a dictionary of lists, and custom row-indexes (labels)**

In [10]:
data = {'Floats': [4.5, 8.2, 9.6],
        'Integers': [1, 2, 3]}

df = pd.DataFrame(data, index = ['label 1', 'label 2', 'label 3'])

df

         Floats  Integers
label 1     4.5         1
label 2     8.2         2
label 3     9.6         3

**Access Elements Using Labels**

In [12]:
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

# We create a DataFrame  and provide the row index
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2'])
store_items

         bikes  pants  watches  glasses
store 1     20     30       35      NaN
store 2     15      5       10     50.0

In [13]:
print(store_items)

# We access rows, columns and elements using labels
print()
print('How many bikes are in each store:\n', store_items[['bikes']])
print()
print('How many bikes and pants are in each store:\n', store_items[['bikes', 'pants']])
print()
print('What items are in Store 1:\n', store_items.loc[['store 1']])
print()
print('How many bikes are in Store 2:', store_items['bikes']['store 2'])

         bikes  pants  watches  glasses
store 1     20     30       35      NaN
store 2     15      5       10     50.0

How many bikes are in each store:
          bikes
store 1     20
store 2     15

How many bikes and pants are in each store:
          bikes  pants
store 1     20     30
store 2     15      5

What items are in Store 1:
          bikes  pants  watches  glasses
store 1     20     30       35      NaN

How many bikes are in Store 2: 15

It is important to know that when accessing individual elements in a DataFrame, the labels should always be provided with the column label first, i.e., in the form dataframe[column][row]. For example, when retrieving the number **bikes** in **store 2**, we first used the column label bikes and then the row label store 2. If we provide the row label first we will get an error.

**Add a column to an existing DataFrame**

In [15]:
store_items['shirts'] = [15, 2]

store_items

         bikes  pants  watches  glasses  shirts
store 1     20     30       35      NaN      15
store 2     15      5       10     50.0       2

In [16]:
store_items['suits'] = store_items['pants'] + store_items['shirts']

store_items

         bikes  pants  watches  glasses  shirts  suits
store 1     20     30       35      NaN      15     45
store 2     15      5       10     50.0       2      7

Suppose now, that you opened a new store and you need to add the number of items in the stock of that new store into your DataFrame. We can do this by adding a new row to the **store_items** Dataframe. To add rows to our DataFrame we first have to create a new Dataframe and then append it to the original DataFrame.

In [18]:
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]
new_store = pd.DataFrame(new_items, index = ['store 3'])

new_store

         bikes  pants  watches  glasses
store 3     20     30       35        4

**Append the row to the DataFrame**

In [19]:
store_items = pd.concat([store_items, new_store])

store_items

         bikes  pants  watches  glasses  shirts  suits
store 1     20     30       35      NaN    15.0   45.0
store 2     15      5       10     50.0     2.0    7.0
store 3     20     30       35      4.0     NaN    NaN

In [20]:
store_items['new watches'] = store_items['watches'][1:]
store_items

         bikes  pants  watches  glasses  shirts  suits  new watches
store 1     20     30       35      NaN    15.0   45.0          NaN
store 2     15      5       10     50.0     2.0    7.0         10.0
store 3     20     30       35      4.0     NaN    NaN         35.0

It is also possible, to insert new columns into the DataFrames anywhere we want. The dataframe.insert(loc, label, data) method allows us to insert a new column in the dataframe at location loc, with the given column label, and given data. Let's add new column named shoes right before the suits column. Since suits has numerical index value 4 then we will use this value as loc.

**Add new column at a specific location**

In [22]:
store_items.insert(4, 'shoes', [8, 5, 0])

store_items

         bikes  pants  watches  glasses  shoes  shirts  suits  new watches
store 1     20     30       35      NaN      8    15.0   45.0          NaN
store 2     15      5       10     50.0      5     2.0    7.0         10.0
store 3     20     30       35      4.0      0     NaN    NaN         35.0

Just as we can add rows and columns we can also delete them. To delete rows and columns from our DataFrame we will use the **.pop()** and **.drop()** methods. The **.pop()** method only allows us **to delete columns**, while the **.drop()** method can be used **to delete both rows and columns by use of the axis keyword**.

**Delete one column from a DataFrame**

In [25]:
store_items.pop('new watches')
store_items

         bikes  pants  watches  glasses  shoes  shirts  suits
store 1     20     30       35      NaN      8    15.0   45.0
store 2     15      5       10     50.0      5     2.0    7.0
store 3     20     30       35      4.0      0     NaN    NaN

**Delete Multiple Columns from a DataFrame**

In [26]:
store_items = store_items.drop(['watches', 'shoes'], axis = 1)

store_items

         bikes  pants  glasses  shirts  suits
store 1     20     30      NaN    15.0   45.0
store 2     15      5     50.0     2.0    7.0
store 3     20     30      4.0     NaN    NaN

**Delete rows from a DataFrame**

In [27]:
store_items = store_items.drop(['store 2', 'store 1'], axis = 0)

store_items

         bikes  pants  glasses  shirts  suits
store 3     20     30      4.0     NaN    NaN

Sometimes we might need to change the row and column labels. Let's change the bikes column label to hats using the **.rename()** method

**Modify the Column Label**

In [28]:
# We change the column label bikes to hats
store_items = store_items.rename(columns = {'bikes': 'hats'})

# we display the modified DataFrame
store_items

         hats  pants  glasses  shirts  suits
store 3    20     30      4.0     NaN    NaN

**Modify the Row Label**

In [29]:
store_items = store_items.rename(index = {'store 3': 'last store'})

store_items

            hats  pants  glasses  shirts  suits
last store    20     30      4.0     NaN    NaN